Reports/ОтчетНекомплектныеАвтомобилиWEB.xml
<?xml version="1.0" encoding="UTF-8"?><MetaDataObject version="2.18">	<Report>		<InternalInfo>			<xr:GeneratedType name="ReportObject.ќтчетЌекомплектныејвтомобилиWEB" category="Object">				<xr:TypeId>26e74134-25b6-4f4c-906a-1c6704157ee3</xr:TypeId>				<xr:ValueId>f2c76171-3af2-4f0f-9b7f-45cd822bd96e</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="ReportManager.ќтчетЌекомплектныејвтомобилиWEB" category="Manager">				<xr:TypeId>b833ef9a-5b09-4c58-bba9-71cefb17f336</xr:TypeId>				<xr:ValueId>dc6aebb2-31a8-429a-8259-5fa10c1067d1</xr:ValueId>			</xr:GeneratedType>		</InternalInfo>		<Properties>			<Name>ќтчетЌекомплектныејвтомобилиWEB</Name>			<Synonym>				<v8:item>					<v8:lang>ru</v8:lang>					<v8:content>ќтчет "Ќекомплектные автомобили" Web</v8:content>				</v8:item>				<v8:item>					<v8:lang>en</v8:lang>					<v8:content>Report by cars with deficiencies</v8:content>				</v8:item>			</Synonym>			<Comment/>			<UseStandardCommands>true</UseStandardCommands>			<DefaultForm>Report.ќтчетЌекомплектныејвтомобилиWEB.Form.‘ормаќтчета</DefaultForm>			<AuxiliaryForm/>			<MainDataCompositionSchema/>			<DefaultSettingsForm/>			<AuxiliarySettingsForm/>			<DefaultVariantForm/>			<VariantsStorage/>			<SettingsStorage/>			<IncludeHelpInContents>false</IncludeHelpInContents>			<ExtendedPresentation/>			<Explanation/>		</Properties>		<ChildObjects>			<Attribute>				<Properties>					<Name>Ётоѕроизводственныйќтчет</Name>					<Synonym>						<v8:item>							<v8:lang>ru</v8:lang>							<v8:content>Ёто производственный отчет</v8:content>						</v8:item>						<v8:item>							<v8:lang>en</v8:lang>							<v8:content>This is production report</v8:content>						</v8:item>					</Synonym>					<Comment>фиктивный реквизит, наличие которого означает, что данна€ обработка сделана по технологии нетиповых обменов </Comment>					<Type>						<v8:Type>xs:string</v8:Type>						<v8:StringQualifiers>							<v8:Length>1</v8:Length>							<v8:AllowedLength>Variable</v8:AllowedLength>						</v8:StringQualifiers>					</Type>					<PasswordMode>false</PasswordMode>					<Format/>					<EditFormat/>					<ToolTip/>					<MarkNegatives>false</MarkNegatives>					<Mask/>					<MultiLine>false</MultiLine>					<ExtendedEdit>false</ExtendedEdit>					<MinValue xsi:nil="true"/>					<MaxValue xsi:nil="true"/>					<FillChecking>DontCheck</FillChecking>					<ChoiceFoldersAndItems>Items</ChoiceFoldersAndItems>					<ChoiceParameterLinks/>					<ChoiceParameters/>					<QuickChoice>Auto</QuickChoice>					<CreateOnInput>Auto</CreateOnInput>					<ChoiceForm/>					<LinkByType/>					<ChoiceHistoryOnInput>Auto</ChoiceHistoryOnInput>				</Properties>			</Attribute>			<Form>‘ормаќтчета</Form>			<Template>ћакет</Template>		</ChildObjects>	</Report></MetaDataObject>

AccumulationRegisters/Некомплекты.xml
<?xml version="1.0" encoding="UTF-8"?><MetaDataObject version="2.18">	<AccumulationRegister>		<InternalInfo>			<xr:GeneratedType name="AccumulationRegisterRecord.Некомплекты" category="Record">				<xr:TypeId>8820d12e-5196-4f47-9bb6-0582667952b2</xr:TypeId>				<xr:ValueId>de79f9c5-999c-40c9-a51c-3d6d0e93f804</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="AccumulationRegisterManager.Некомплекты" category="Manager">				<xr:TypeId>6f1901d2-e416-4493-b7aa-a9584edb46bf</xr:TypeId>				<xr:ValueId>973969cf-bc07-43a6-b895-4c516adfa2d8</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="AccumulationRegisterSelection.Некомплекты" category="Selection">				<xr:TypeId>b51dec7d-015d-4fae-b4a6-28f46846a593</xr:TypeId>				<xr:ValueId>41df6380-66bc-4724-88c0-b10679140e5c</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="AccumulationRegisterList.Некомплекты" category="List">				<xr:TypeId>2fe74f09-ef15-4f2b-b352-9f891b44ee28</xr:TypeId>				<xr:ValueId>b057261d-7572-4258-9ba3-71d266a3593a</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="AccumulationRegisterRecordSet.Некомплекты" category="RecordSet">				<xr:TypeId>26fce9d4-2a17-4f52-b753-f85a66b1cbbe</xr:TypeId>				<xr:ValueId>44ff6c5b-5cca-4695-921f-0b1fb12bdfb5</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="AccumulationRegisterRecordKey.Некомплекты" category="RecordKey">				<xr:TypeId>f052c8fd-a058-478d-b19f-f780bf7aea95</xr:TypeId>				<xr:ValueId>0b620843-5f0d-4afc-993f-244a7dce075b</xr:ValueId>			</xr:GeneratedType>		</InternalInfo>		<Properties>			<Name>Некомплекты</Name>			<Synonym>				<v8:item>					<v8:lang>ru</v8:lang>					<v8:content>Некомплекты</v8:content>				</v8:item>				<v8:item>					<v8:lang>en</v8:lang>					<v8:content>Deficiencies</v8:content>				</v8:item>			</Synonym>			<Comment/>			<UseStandardCommands>true</UseStandardCommands>			<DefaultListForm/>			<AuxiliaryListForm/>			<RegisterType>Balance</RegisterType>			<IncludeHelpInContents>false</IncludeHelpInContents>			<StandardAttributes>				<xr:StandardAttribute name="RecordType">					<xr:LinkByType/>					<xr:FillChecking>DontCheck</xr:FillChecking>					<xr:MultiLine>false</xr:MultiLine>					<xr:FillFromFillingValue>false</xr:FillFromFillingValue>					<xr:CreateOnInput>Auto</xr:CreateOnInput>					<xr:TypeReductionMode>TransformValues</xr:TypeReductionMode>					<xr:MaxValue xsi:nil="true"/>					<xr:ToolTip/>					<xr:ExtendedEdit>false</xr:ExtendedEdit>					<xr:Format/>					<xr:ChoiceForm/>					<xr:QuickChoice>Auto</xr:QuickChoice>					<xr:ChoiceHistoryOnInput>Auto</xr:ChoiceHistoryOnInput>					<xr:EditFormat/>					<xr:PasswordMode>false</xr:PasswordMode>					<xr:DataHistory>Use</xr:DataHistory>					<xr:MarkNegatives>false</xr:MarkNegatives>					<xr:MinValue xsi:nil="true"/>					<xr:Synonym/>					<xr:Comment/>					<xr:FullTextSearch>Use</xr:FullTextSearch>					<xr:ChoiceParameterLinks/>					<xr:FillValue xsi:nil="true"/>					<xr:Mask/>					<xr:ChoiceParameters/>				</xr:StandardAttribute>				<xr:StandardAttribute name="Active">					<xr:LinkByType/>					<xr:FillChecking>DontCheck</xr:FillChecking>					<xr:MultiLine>false</xr:MultiLine>					<xr:FillFromFillingValue>false</xr:FillFromFillingValue>					<xr:CreateOnInput>Auto</xr:CreateOnInput>					<xr:TypeReductionMode>TransformValues</xr:TypeReductionMode>					<xr:MaxValue xsi:nil="true"/>					<xr:ToolTip/>					<xr:ExtendedEdit>false</xr:ExtendedEdit>					<xr:Format/>					<xr:ChoiceForm/>					<xr:QuickChoice>Auto</xr:QuickChoice>					<xr:ChoiceHistoryOnInput>Auto</xr:ChoiceHistoryOnInput>					<xr:EditFormat/>					<xr:PasswordMode>false</xr:PasswordMode>					<xr:DataHistory>Use</xr:DataHistory>					<xr:MarkNegatives>false</xr:MarkNegatives>					<xr:MinValue xsi:nil="true"/>					<xr:Synonym/>					<xr:Comment/>					<xr:FullTextSearch>Use</xr:FullTextSearch>					<xr:ChoiceParameterLinks/>					<xr:FillValue xsi:nil="true"/>					<xr:Mask/>					<xr:ChoiceParameters/>				</xr:StandardAttribute>				<xr:StandardAttribute name="LineNumber">					<xr:LinkByType/>					<xr:FillChecking>DontCheck</xr:FillChecking>					<xr:MultiLine>false</xr:MultiLine>					<xr:FillFromFillingValue>false</xr:FillFromFillingValue>					<xr:CreateOnInput>Auto</xr:CreateOnInput>					<xr:TypeReductionMode>TransformValues</xr:TypeReductionMode>					<xr:MaxValue xsi:nil="true"/>					<xr:ToolTip/>					<xr:ExtendedEdit>false</xr:ExtendedEdit>					<xr:Format/>					<xr:ChoiceForm/>					<xr:QuickChoice>Auto</xr:QuickChoice>					<xr:ChoiceHistoryOnInput>Auto</xr:ChoiceHistoryOnInput>					<xr:EditFormat/>					<xr:PasswordMode>false</xr:PasswordMode>					<xr:DataHistory>Use</xr:DataHistory>					<xr:MarkNegatives>false</xr:MarkNegatives>					<xr:MinValue xsi:nil="true"/>					<xr:Synonym/>					<xr:Comment/>					<xr:FullTextSearch>Use</xr:FullTextSearch>					<xr:ChoiceParameterLinks/>					<xr:FillValue xsi:nil="true"/>					<xr:Mask/>					<xr:ChoiceParameters/>				</xr:StandardAttribute>				<xr:StandardAttribute name="Recorder">					<xr:LinkByType/>					<xr:FillChecking>DontCheck</xr:FillChecking>					<xr:MultiLine>false</xr:MultiLine>					<xr:FillFromFillingValue>false</xr:FillFromFillingValue>					<xr:CreateOnInput>Auto</xr:CreateOnInput>					<xr:TypeReductionMode>TransformValues</xr:TypeReductionMode>					<xr:MaxValue xsi:nil="true"/>					<xr:ToolTip/>					<xr:ExtendedEdit>false</xr:ExtendedEdit>					<xr:Format/>					<xr:ChoiceForm/>					<xr:QuickChoice>Auto</xr:QuickChoice>					<xr:ChoiceHistoryOnInput>Auto</xr:ChoiceHistoryOnInput>					<xr:EditFormat/>					<xr:PasswordMode>false</xr:PasswordMode>					<xr:DataHistory>Use</xr:DataHistory>					<xr:MarkNegatives>false</xr:MarkNegatives>					<xr:MinValue xsi:nil="true"/>					<xr:Synonym/>					<xr:Comment/>					<xr:FullTextSearch>Use</xr:FullTextSearch>					<xr:ChoiceParameterLinks/>					<xr:FillValue xsi:nil="true"/>					<xr:Mask/>					<xr:ChoiceParameters/>				</xr:StandardAttribute>				<xr:StandardAttribute name="Period">					<xr:LinkByType/>					<xr:FillChecking>ShowError</xr:FillChecking>					<xr:MultiLine>false</xr:MultiLine>					<xr:FillFromFillingValue>false</xr:FillFromFillingValue>					<xr:CreateOnInput>Auto</xr:CreateOnInput>					<xr:TypeReductionMode>TransformValues</xr:TypeReductionMode>					<xr:MaxValue xsi:nil="true"/>					<xr:ToolTip/>					<xr:ExtendedEdit>false</xr:ExtendedEdit>					<xr:Format/>					<xr:ChoiceForm/>					<xr:QuickChoice>Auto</xr:QuickChoice>					<xr:ChoiceHistoryOnInput>Auto</xr:ChoiceHistoryOnInput>					<xr:EditFormat/>					<xr:PasswordMode>false</xr:PasswordMode>					<xr:DataHistory>Use</xr:DataHistory>					<xr:MarkNegatives>false</xr:MarkNegatives>					<xr:MinValue xsi:nil="true"/>					<xr:Synonym/>					<xr:Comment/>					<xr:FullTextSearch>Use</xr:FullTextSearch>					<xr:ChoiceParameterLinks/>					<xr:FillValue xsi:nil="true"/>					<xr:Mask/>					<xr:ChoiceParameters/>				</xr:StandardAttribute>			</StandardAttributes>			<DataLockControlMode>Managed</DataLockControlMode>			<FullTextSearch>DontUse</FullTextSearch>			<EnableTotalsSplitting>true</EnableTotalsSplitting>			<ListPresentation/>			<ExtendedListPresentation/>			<Explanation/>		</Properties>		<ChildObjects>			<Resource>				<Properties>					<Name>Количество</Name>					<Synonym>						<v8:item>							<v8:lang>ru</v8:lang>							<v8:content>Количество</v8:content>						</v8:item>						<v8:item>							<v8:lang>en</v8:lang>							<v8:content>Quantity</v8:content>						</v8:item>					</Synonym>					<Comment/>					<Type>						<v8:Type>xs:decimal</v8:Type>						<v8:NumberQualifiers>							<v8:Digits>10</v8:Digits>							<v8:FractionDigits>3</v8:FractionDigits>							<v8:AllowedSign>Any</v8:AllowedSign>						</v8:NumberQualifiers>					</Type>					<PasswordMode>false</PasswordMode>					<Format/>					<EditFormat/>					<ToolTip/>					<MarkNegatives>false</MarkNegatives>					<Mask/>					<MultiLine>false</MultiLine>					<ExtendedEdit>false</ExtendedEdit>					<MinValue xsi:nil="true"/>					<MaxValue xsi:nil="true"/>					<FillChecking>DontCheck</FillChecking>					<ChoiceFoldersAndItems>Items</ChoiceFoldersAndItems>					<ChoiceParameterLinks/>					<ChoiceParameters/>					<QuickChoice>Auto</QuickChoice>					<CreateOnInput>Auto</CreateOnInput>					<ChoiceForm/>					<LinkByType/>					<ChoiceHistoryOnInput>Auto</ChoiceHistoryOnInput>					<FullTextSearch>Use</FullTextSearch>				</Properties>			</Resource>			<Attribute>				<Properties>					<Name>Смена</Name>					<Synonym>						<v8:item>							<v8:lang>ru</v8:lang>							<v8:content>Смена</v8:content>						</v8:item>						<v8:item>							<v8:lang>en</v8:lang>							<v8:content>Shift</v8:content>						</v8:item>					</Synonym>					<Comment/>					<Type>						<v8:Type>cfg:CatalogRef.Смены</v8:Type>					</Type>					<PasswordMode>false</PasswordMode>					<Format/>					<EditFormat/>					<ToolTip/>					<MarkNegatives>false</MarkNegatives>					<Mask/>					<MultiLine>false</MultiLine>					<ExtendedEdit>false</ExtendedEdit>					<MinValue xsi:nil="true"/>					<MaxValue xsi:nil="true"/>					<FillChecking>DontCheck</FillChecking>					<ChoiceFoldersAndItems>Items</ChoiceFoldersAndItems>					<ChoiceParameterLinks/>					<ChoiceParameters/>					<QuickChoice>Auto</QuickChoice>					<CreateOnInput>Auto</CreateOnInput>					<ChoiceForm/>					<LinkByType/>					<ChoiceHistoryOnInput>Auto</ChoiceHistoryOnInput>					<Indexing>DontIndex</Indexing>					<FullTextSearch>Use</FullTextSearch>				</Properties>			</Attribute>			<Attribute>				<Properties>					<Name>ДатаСмены</Name>					<Synonym>						<v8:item>							<v8:lang>ru</v8:lang>							<v8:content>Дата смены</v8:content>						</v8:item>						<v8:item>							<v8:lang>en</v8:lang>							<v8:content>Date of shift</v8:content>						</v8:item>					</Synonym>					<Comment/>					<Type>						<v8:Type>xs:dateTime</v8:Type>						<v8:DateQualifiers>							<v8:DateFractions>Date</v8:DateFractions>						</v8:DateQualifiers>					</Type>					<PasswordMode>false</PasswordMode>					<Format/>					<EditFormat/>					<ToolTip/>					<MarkNegatives>false</MarkNegatives>					<Mask/>					<MultiLine>false</MultiLine>					<ExtendedEdit>false</ExtendedEdit>					<MinValue xsi:nil="true"/>					<MaxValue xsi:nil="true"/>					<FillChecking>DontCheck</FillChecking>					<ChoiceFoldersAndItems>Items</ChoiceFoldersAndItems>					<ChoiceParameterLinks/>					<ChoiceParameters/>					<QuickChoice>Auto</QuickChoice>					<CreateOnInput>Auto</CreateOnInput>					<ChoiceForm/>					<LinkByType/>					<ChoiceHistoryOnInput>Auto</ChoiceHistoryOnInput>					<Indexing>DontIndex</Indexing>					<FullTextSearch>Use</FullTextSearch>				</Properties>			</Attribute>			<Dimension>				<Properties>					<Name>Заказ</Name>					<Synonym>						<v8:item>							<v8:lang>ru</v8:lang>							<v8:content>Заказ</v8:content>						</v8:item>						<v8:item>							<v8:lang>en</v8:lang>							<v8:content>Order</v8:content>						</v8:item>					</Synonym>					<Comment/>					<Type>						<v8:Type>cfg:CatalogRef.Заказы</v8:Type>					</Type>					<PasswordMode>false</PasswordMode>					<Format/>					<EditFormat/>					<ToolTip/>					<MarkNegatives>false</MarkNegatives>					<Mask/>					<MultiLine>false</MultiLine>					<ExtendedEdit>false</ExtendedEdit>					<MinValue xsi:nil="true"/>					<MaxValue xsi:nil="true"/>					<FillChecking>DontCheck</FillChecking>					<ChoiceFoldersAndItems>Items</ChoiceFoldersAndItems>					<ChoiceParameterLinks/>					<ChoiceParameters/>					<QuickChoice>Auto</QuickChoice>					<CreateOnInput>Auto</CreateOnInput>					<ChoiceForm/>					<LinkByType/>					<ChoiceHistoryOnInput>Auto</ChoiceHistoryOnInput>					<DenyIncompleteValues>true</DenyIncompleteValues>					<Indexing>Index</Indexing>					<FullTextSearch>Use</FullTextSearch>					<UseInTotals>true</UseInTotals>				</Properties>			</Dimension>			<Dimension>				<Properties>					<Name>Номенклатура</Name>					<Synonym>						<v8:item>							<v8:lang>ru</v8:lang>							<v8:content>Номенклатура</v8:content>						</v8:item>						<v8:item>							<v8:lang>en</v8:lang>							<v8:content>Nomenclature</v8:content>						</v8:item>					</Synonym>					<Comment/>					<Type>						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>					</Type>					<PasswordMode>false</PasswordMode>					<Format/>					<EditFormat/>					<ToolTip/>					<MarkNegatives>false</MarkNegatives>					<Mask/>					<MultiLine>false</MultiLine>					<ExtendedEdit>false</ExtendedEdit>					<MinValue xsi:nil="true"/>					<MaxValue xsi:nil="true"/>					<FillChecking>DontCheck</FillChecking>					<ChoiceFoldersAndItems>Items</ChoiceFoldersAndItems>					<ChoiceParameterLinks/>					<ChoiceParameters/>					<QuickChoice>Auto</QuickChoice>					<CreateOnInput>Auto</CreateOnInput>					<ChoiceForm/>					<LinkByType/>					<ChoiceHistoryOnInput>Auto</ChoiceHistoryOnInput>					<DenyIncompleteValues>true</DenyIncompleteValues>					<Indexing>DontIndex</Indexing>					<FullTextSearch>Use</FullTextSearch>					<UseInTotals>true</UseInTotals>				</Properties>			</Dimension>		</ChildObjects>	</AccumulationRegister></MetaDataObject>

Reports/ОтчетНекомплектныеАвтомобилиWEB/Ext/ManagerModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

Функция СформироватьОтчет(ДатаОтчета, ТекстОшибки ="", ПараметрыВывода = Неопределено) Экспорт		
	ТабДокумент = Новый ТабличныйДокумент;
	Макет = Отчеты.ОтчетНекомплектныеАвтомобилиWEB.ПолучитьМакет("Макет");
	ТекстОшибки = "";
	ТабДокумент.Очистить();
	Если НЕ ЗначениеЗаполнено(ДатаОтчета)Тогда
		ДатаОтчета = ТекущаяДата();
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НекомплектыОстатки.Номенклатура КАК Номенклатура,
		|	СУММА(НекомплектыОстатки.КоличествоОстаток) КАК КоличествоНом
		|ПОМЕСТИТЬ ГруппировкаПоНом
		|ИЗ
		|	РегистрНакопления.Некомплекты.Остатки(&Дата, ) КАК НекомплектыОстатки
		|ГДЕ
		|	НекомплектыОстатки.КоличествоОстаток > 0
		|
		|СГРУППИРОВАТЬ ПО
		|	НекомплектыОстатки.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НекомплектыОстатки.Заказ,
		|	НекомплектыОстатки.Номенклатура.Наименование + "", "" + НекомплектыОстатки.Номенклатура.КодЗавода КАК Номенклатура,
		|	СУММА(НекомплектыОстатки.КоличествоОстаток) КАК Количество,
		|	ГруппировкаПоНом.КоличествоНом
		|ИЗ
		|	РегистрНакопления.Некомплекты.Остатки(&Дата, ) КАК НекомплектыОстатки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ГруппировкаПоНом КАК ГруппировкаПоНом
		|		ПО НекомплектыОстатки.Номенклатура = ГруппировкаПоНом.Номенклатура
		|ГДЕ
		|	НекомплектыОстатки.КоличествоОстаток > 0
		|
		|СГРУППИРОВАТЬ ПО
		|	НекомплектыОстатки.Заказ,
		|	НекомплектыОстатки.Номенклатура.Наименование + "", "" + НекомплектыОстатки.Номенклатура.КодЗавода,
		|	ГруппировкаПоНом.КоличествоНом
		|
		|УПОРЯДОЧИТЬ ПО
		|	ГруппировкаПоНом.КоличествоНом УБЫВ
		|ИТОГИ
		|	СУММА(Количество)
		|ПО
		|	Номенклатура";

	Запрос.УстановитьПараметр("Дата", ДатаОтчета);

	Результат = Запрос.Выполнить();
	
	СекцияШапка = Макет.ПолучитьОбласть("Шапка");
	ТабДокумент.Вывести(СекцияШапка);

	ВыборкаНоменклатура = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	Пока ВыборкаНоменклатура.Следующий() Цикл
		СекцияСтрока = Макет.ПолучитьОбласть("СтрНоменклатура");
		ЗаполнитьЗначенияСвойств(СекцияСтрока.Параметры,ВыборкаНоменклатура);
		СекцияСтрока.Параметры.ОбщКолво = ВыборкаНоменклатура.Количество;
		ТабДокумент.Вывести(СекцияСтрока);

		ВыборкаДетальныеЗаписи = ВыборкаНоменклатура.Выбрать();

		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СекцияСтрока = Макет.ПолучитьОбласть("СтрЗаказ");
			ЗаполнитьЗначенияСвойств(СекцияСтрока.Параметры,ВыборкаДетальныеЗаписи);
			ТабДокумент.Вывести(СекцияСтрока);
		КонецЦикла;
	КонецЦикла;

	    	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
